class Function:
    source_code = 'https://github.com/vivien8261/Amiya-Bot'
    source_code_key = ['代码', '源码']
    query_key = ['可以做什么', '能做什么', '会做什么', '会干什么', '会什么', '有什么功能', '功能', '菜单']
    index_reg = ['第(\\d+)(.*)功能', '功能(\\d+)']
    function_list = [
        {
            'id': None,
            'title': '群管理员功能',
            'desc': [
                '【群管理员功能仅限群主与群管理员使用】',
                '发送「阿米娅休息」在本群关闭阿米娅',
                '发送「阿米娅工作」在本群开启阿米娅',
                '发送「阿米娅关闭第 N 个功能」在本群关闭单个功能',
                '发送「阿米娅打开第 N 个功能」在本群打开单个功能',
                '发送「阿米娅功能关闭列表」查看在本群关闭的功能'
            ]
        },
        {
            'id': 'normal',
            'title': '普通互动',
            'desc': [
                '只呼叫阿米娅或戳一戳，阿米娅会随机发送表情包',
                '发送「阿米娅签到」可以进行每日签到',
                '更多互动作者也不记得了...'
            ]
        },
        {
            'id': 'userInfo',
            'title': '查看个人信息',
            'desc': ['发送「阿米娅查看我的信息」']
        },
        {
            'id': 'checkOperator',
            'title': '查询干员基础资料',
            'desc': ['发送「阿米娅查看【干员名】」']
        },
        {
            'id': 'checkOperator',
            'title': '查询干员精英化材料',
            'desc': ['发送「阿米娅查看【干员名】精二材料」']
        },
        {
            'id': 'checkOperator',
            'title': '查询干员技能专精材料',
            'desc': [
                '发送「阿米娅查看【干员名】专三材料」',
                '发送「阿米娅查看【技能名】专三材料」',
                '发送「阿米娅查看【干员名】三技能专三材料」'
            ]
        },
        {
            'id': 'checkOperator',
            'title': '查询干员技能数据',
            'desc': [
                '发送「阿米娅查看【干员名】7级技能」',
                '发送「阿米娅查看【技能名】7级」',
                '发送「阿米娅查看【干员名】三技能专三」'
            ]
        },
        {
            'id': 'checkOperator',
            'title': '查询干员模组信息',
            'desc': [
                '发送「阿米娅查看【干员名】模组」'
            ]
        },
        {
            'id': 'checkOperator',
            'title': '查询干员档案',
            'desc': [
                '发送「阿米娅查看【干员名】基础档案」',
                '目前可查询的档案如下：',
                ' -- 【基础档案】',
                ' -- 【综合性能检测结果】',
                ' -- 【客观履历】',
                ' -- 【档案资料一】',
                ' -- 【综合体检测试】',
                ' -- 【临床诊断分析】',
                ' -- 【档案资料二】',
                ' -- 【档案资料三】',
                ' -- 【档案资料四】',
                ' -- 【源石技艺评定】',
                ' -- 【晋升记录】',
                ' -- 【晋升资料】',
                ' -- 【升变档案一】'
            ]
        },
        {
            'id': 'checkOperator',
            'title': '查询干员语音资料',
            'desc': [
                '发送「阿米娅查看【干员名】语音【语音标题】」'
            ]
        },
        {
            'id': 'checkOperator',
            'title': '查询干员皮肤资料',
            'desc': [
                '发送「阿米娅查看【干员名】皮肤」',
                '发送「阿米娅查看皮肤【皮肤名】」'
            ]
        },
        {
            'id': 'checkEnemy',
            'title': '查询敌方单位资料',
            'desc': [
                '发送「阿米娅查看敌人【敌人名】」'
            ]
        },
        {
            'id': 'checkMaterial',
            'title': '查询材料或物品',
            'desc': [
                '发送「阿米娅查看【材料/物品名】」',
                '如果不记得准确名字，指令内必须带有“材料”或“物品”关键词'
            ]
        },
        {
            'id': 'recruit',
            'title': '公招查询',
            'desc': [
                '发送「阿米娅公招生存防护」',
                '发送「阿米娅公招」同时带有公招的游戏截图，可以自动识别查询',
                '发送「阿米娅公招」后，发送公招的游戏截图，可以自动识别查询'
            ]
        },
        {
            'id': 'gacha',
            'title': '模拟抽卡',
            'desc': [
                '发送「阿米娅 N 连抽」或「阿米娅抽卡 N 次」',
                '发送「阿米娅卡池列表」可以查看卡池列表',
                '发送「阿米娅卡池切换【卡池名称】」可以切换卡池',
                '发送「阿米娅剩余多少抽卡券」可以查看抽卡券余额'
            ]
        },
        {
            'id': 'jadeCalculator',
            'title': '合成玉计算',
            'desc': ['发送「阿米娅2020年8月15日前可得到多少玉」（年份非必须）']
        },
        {
            'id': 'intellectAlarm',
            'title': '理智恢复提醒',
            'desc': [
                '发送「阿米娅理智 N 满 N 告诉我」',
                '记录提醒后发送「阿米娅理智回复了多少」查看进度'
            ]
        },
        {
            'id': 'weibo',
            'title': '查看明日方舟微博最新动态',
            'desc': [
                '发送「阿米娅最新微博」或「阿米娅微博列表」',
                '【限定功能】当微博动态更新时阿米娅会主动推送新微博到群'
            ]
        },
        {
            'id': None,
            'title': '查看阿米娅的源代码',
            'desc': 'source_code'
        }
    ]
    function_titles = []
    function_groups = {}

    for item in function_list:
        function_titles.append(item['title'])
        if item['id']:
            if item['id'] not in function_groups:
                function_groups[item['id']] = []

            function_groups[item['id']].append(item['title'])
