class InfoInterface:
    def __init__(self):
        self.name = ''
        self.level = 0
        self.skill = ''
        self.skin_key = ''
        self.voice_key = ''
        self.story_key = ''
        self.skill_index = 0


class InitData:
    sp_type = {
        1: '自动回复',
        2: '攻击回复',
        4: '受击回复',
        8: '被动'
    }
    class_type = {
        1: '先锋',
        2: '近卫',
        3: '重装',
        4: '狙击',
        5: '术师',
        6: '辅助',
        7: '医疗',
        8: '特种'
    }
    skill_type = {
        0: '被动',
        1: '手动触发',
        2: '自动触发'
    }
    skill_level = {
        1: '等级1',
        2: '等级2',
        3: '等级3',
        4: '等级4',
        5: '等级5',
        6: '等级6',
        7: '等级7',
        8: '专精1',
        9: '专精2',
        10: '专精3'
    }
    potential_rank = {
        1: '一',
        2: '丅',
        3: '上',
        4: '止',
        5: '正'
    }
    skins = [
        '皮肤', '服装', '衣服', '时装'
    ]
    voices = [
        '任命助理', '任命队长', '编入队伍', '问候', '闲置',
        '交谈1', '交谈2', '交谈3', '晋升后交谈1', '晋升后交谈2',
        '信赖提升后交谈1', '信赖提升后交谈2', '信赖提升后交谈3',
        '精英化晋升1', '精英化晋升2',
        '行动出发', '行动失败', '行动开始', '3星结束行动', '4星结束行动', '非3星结束行动',
        '选中干员1', '选中干员2', '部署1', '部署2', '作战中1', '作战中2', '作战中3', '作战中4',
        '戳一下', '信赖触摸', '干员报到', '进驻设施', '观看作战记录', '标题'
    ]
